Updated "NBBL Overview with Merchant Hosted" in docs
